<?php
/* @var $this SiteController */

$this->pageTitle=Yii::app()->name;
?>

<h1>Добре дошли в играта <i>"<?php echo CHtml::encode(Yii::app()->name); ?>"</i></h1>

<p>Играта генерира едно произволно число от 1 до <?php echo MAX_NUMBER; ?>. Познайте числото :-)</p>

<h2>Правила:</h2>
<ul>
	<li>Предоставя се възможност за игра само на регистрирани потребители, влезли в системата.</li>
    <li>При започване на нова игра се генерира произволно число
между 1 и <?php echo MAX_NUMBER; ?>. Вие трябва да познаете числото.<br />При неуцелване на числото, се дава обратна информация, дали търсеното число е по-голямо или по-малко от предложеното.</li>
    <li>Максимален брой опити <?php echo MAX_NUMBER-1; ?>.</li>
    <li>След уцелване на числото се запазва броя опити направени, докато сте познали числото.</li>
	<li>Потребителите имат право на неограничен брой игри, като след третата биват включени в публичната ранглиста.</li>
    <li>Коефициентът, на базата на който се класират играчите в ранглистата, е средния брой опити, необходим за уцелването на числото на отделния играч.</li>
</ul>

<?php
    echo CHtml::link('Стартирай нова игра', array('user/login'), 
            array('id'=>'play', 'class'=>'btn_link'));
?>

<div id="game">
<div style="float: left; padding-right: 20px;">
<h1>Въведете число: <?php echo CHtml::textField('num', '', array('size'=>'3')); ?></h1>
<h1>Брой опити: <span id='trys'>0</span></h1>
<?php
    echo CHtml::link('Познай числото', '#', array('id'=>'guess', 'class'=>'btn_link'));
?>
</div>

<div class="err"></div>
<div class="ok"></div>

</div>
